[
  {
    "title": "SWÜP",
    "image": "./projectImages/swupdemo.png",
    "description": "I was responsible for the view fuction of the customer posts for SWÜP, an application that that streamlines the process for users by creating a centralized platform to post and accept garbage disposal jobs. Within this function, a user can see the details of all of their posts, the statuses of their pickup, and the contact information for the Swooper that accepted their job. Utilises the React.js library and Boostrap library to create a single page application delivering a seamless user experience ",
    "technologies": "Python | Javascript | FastAPI | React | PostgreSQL | Bootstrap",
    "github": "https://gitlab.com/projectswup/module3-project-gamma",
    "deployed": "https://projectswup.gitlab.io/module3-project-gamma/",
    "bgcolor": "#ffbf0f",
    "id": "1"
  },
  {
    "title": "Brewgatti",
    "image": "./projectImages/brewgatti.png",
    "technologies": "Python | Javascript | Django | React | PostgreSQL | Bootstrap",
    "description": " This dashboard uses the OpenWeatherMap API to retrieve detailed weather data, including the city name, date, weather icon, temperature, humidity, and wind speed. The dashboard has a 5-day forecast feature and a search history feature that saves past searches for easy access. It also has a dark/light theme that changes the look of the page based on day or night in the searched location and uses the geolocation API to automatically determine the user's current location and display the weather.",
    "github": "https://github.com/aphamdev/brewgatti",
    "deployed": null,
    "bgcolor": "#ff4d00",
    "id": "2"
  },
  {
    "title": "InnerView",
    "image": "./projectImages/innerview.png",
    "technologies": "Python | Django | HTML | CSS",
    "description": "Developed a simple web application, InnerView, to help track interviews during the job search. Implemented a functionality that would sort the interviews by date. Gives the user the ability to link the original job posting and notes to help prepare.",
    "github": "https://github.com/aphamdev/inner-view",
    "deployed": null,
    "bgcolor": "#6c4bf4",
    "id": "3"
  }
]
